ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/sagScenario/CreateCase_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:SagOpret_I revision="gero et">
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>49705142-cb3f-4428-b507-c0235fc744be_TEST</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-11-29T12:04:22Z</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:Sag>
                <ns:SagOplysninger>
                    <ns:SagProfilValg>
                        <ns:SagProfilOplysninger>
                            <ns:SagMyndighed>20</ns:SagMyndighed>
                            <ns:SagGruppe>38.00.00</ns:SagGruppe>
                            <ns:SagProcesKode>Sag</ns:SagProcesKode>
                            <ns:SagHandlingFacet>1.10</ns:SagHandlingFacet>
                            <ns:SagTilstandKode>100I</ns:SagTilstandKode>
                        </ns:SagProfilOplysninger>
                    </ns:SagProfilValg>
                    <ns:SagTitel>Test case</ns:SagTitel>
                    <ns:SagBemærkning>Creation</ns:SagBemærkning>
                    <ns:SagPartListe/>
                    <ns:SagEmneordListe/>
                    <ns:SagErindringListe/>
                    <ns:SagFriDatoListe/>
                    <ns:SagFriOplysningListe/>
                    <ns:SagRelationListe/>
                </ns:SagOplysninger>
            </ns:Sag>
        </ns:SagOpret_I>
    </soapenv:Body>
</soapenv:Envelope>